{
  "irVersion": "1.0",
  "kind": "ResolvedAgentTask",
  "buildId": "reference-only-not-a-portable-hash",
  "sources": [
    { "id": "urn:faf:constitution:core", "version": "0.1.0" },
    { "id": "urn:faf:contract:agent:reference-engineer", "version": "1.0.0" },
    { "id": "urn:faf:contract:task:update-docs", "version": "1.0.0" },
    { "id": "urn:faf:genome:reference-engineer", "version": "1.0.0" },
    { "id": "urn:faf:role:software-engineer", "version": "1.0.0" },
    { "id": "urn:faf:domain:software-engineering", "version": "1.0.0" },
    { "id": "urn:faf:capability:edit-files", "version": "1.0.0" },
    { "id": "urn:faf:tool:workspace-editor", "version": "1.0.0" },
    { "id": "urn:faf:gate:scope-and-evidence", "version": "1.0.0" }
  ],
  "agent": {
    "genome": { "id": "urn:faf:genome:reference-engineer", "version": "1.0.0" },
    "contract": { "id": "urn:faf:contract:agent:reference-engineer", "version": "1.0.0" },
    "role": { "id": "urn:faf:role:software-engineer", "version": "1.0.0" },
    "domains": [{ "id": "urn:faf:domain:software-engineering", "version": "1.0.0" }],
    "lifecycle": "experimental"
  },
  "task": {
    "contract": { "id": "urn:faf:contract:task:update-docs", "version": "1.0.0" },
    "taskType": "documentation-change",
    "objective": "Update architecture documentation consistently.",
    "inputs": ["Repository documentation"],
    "constraints": ["Do not modify implementation files"],
    "acceptanceCriteria": ["Local Markdown links resolve", "Documents use canonical terminology"],
    "riskLevel": "low",
    "requiredOutput": "markdown-report",
    "escalationConditions": ["Requested work exceeds documentation scope"]
  },
  "behavior": {
    "policies": [],
    "reasoning": [],
    "instructions": ["Inspect relevant context before changing files", "Report validation evidence"]
  },
  "authority": {
    "capabilities": [{ "id": "urn:faf:capability:edit-files", "version": "1.0.0" }],
    "tools": [{ "id": "urn:faf:tool:workspace-editor", "version": "1.0.0" }],
    "prohibitedActions": ["Claim final approval authority", "Perform destructive repository operations"],
    "reviewRequirements": ["Human review before operational use"]
  },
  "qualityGates": [{
    "source": { "id": "urn:faf:gate:scope-and-evidence", "version": "1.0.0" },
    "phase": "post-execution",
    "passCriteria": ["Changes remain in scope", "Validation results are reported"],
    "failureAction": "block"
  }],
  "provenance": [
    {
      "target": "/authority",
      "sources": [
        { "id": "urn:faf:contract:agent:reference-engineer", "version": "1.0.0" },
        { "id": "urn:faf:contract:task:update-docs", "version": "1.0.0" }
      ]
    },
    {
      "target": "/behavior/instructions",
      "sources": [{ "id": "urn:faf:role:software-engineer", "version": "1.0.0" }]
    }
  ]
}
