{
  "irVersion": "1.0",
  "kind": "ResolvedAgentTask",
  "buildId": "sha256:8be51b3b56eac9da1d820c29630fd5f74e57de30ffbe06b0c1673064a5980c5d",
  "sources": [
    {
      "id": "urn:faf:capability:edit-files",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:constitution:core",
      "version": "0.1.0"
    },
    {
      "id": "urn:faf:contract:agent:reference-engineer",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:contract:task:update-docs",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:domain:software-engineering",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:gate:scope-and-evidence",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:genome:reference-engineer",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:policy:reference-operations",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:role:software-engineer",
      "version": "1.0.0"
    },
    {
      "id": "urn:faf:tool:workspace-editor",
      "version": "1.0.0"
    }
  ],
  "agent": {
    "genome": {
      "id": "urn:faf:genome:reference-engineer",
      "version": "1.0.0"
    },
    "contract": {
      "id": "urn:faf:contract:agent:reference-engineer",
      "version": "1.0.0"
    },
    "role": {
      "id": "urn:faf:role:software-engineer",
      "version": "1.0.0"
    },
    "domains": [
      {
        "id": "urn:faf:domain:software-engineering",
        "version": "1.0.0"
      }
    ],
    "lifecycle": "experimental"
  },
  "task": {
    "contract": {
      "id": "urn:faf:contract:task:update-docs",
      "version": "1.0.0"
    },
    "taskType": "documentation-change",
    "objective": "Update architecture documentation consistently.",
    "inputs": [
      "Repository documentation"
    ],
    "constraints": [
      "Do not modify implementation files"
    ],
    "acceptanceCriteria": [
      "Local Markdown links resolve",
      "Documents use canonical terminology"
    ],
    "riskLevel": "low",
    "requiredOutput": "markdown-report",
    "escalationConditions": [
      "Requested work exceeds documentation scope"
    ]
  },
  "behavior": {
    "policies": [
      "Moderate or higher risk requires human review",
      "Production deployment is denied"
    ],
    "reasoning": [],
    "instructions": [
      "Inspect relevant context before changing files",
      "Report validation evidence",
      "Preserve unrelated user changes",
      "Validate changes proportionally to risk"
    ],
    "policyDecisions": [
      {
        "source": {
          "id": "urn:faf:policy:reference-operations",
          "version": "1.0.0"
        },
        "ruleId": "deny-production-task",
        "effect": "deny",
        "subject": "task-type",
        "value": "production-deployment",
        "matched": false,
        "message": "Production deployment is outside this reference policy."
      },
      {
        "source": {
          "id": "urn:faf:policy:reference-operations",
          "version": "1.0.0"
        },
        "ruleId": "review-moderate-risk",
        "effect": "require-human-review",
        "subject": "risk-level",
        "value": "moderate",
        "matched": false,
        "message": "Moderate or higher risk requires human review."
      }
    ]
  },
  "authority": {
    "capabilities": [
      {
        "id": "urn:faf:capability:edit-files",
        "version": "1.0.0"
      }
    ],
    "tools": [
      {
        "id": "urn:faf:tool:workspace-editor",
        "version": "1.0.0"
      }
    ],
    "prohibitedActions": [
      "Claim approval authority",
      "Claim final approval authority",
      "Perform destructive repository operations"
    ],
    "reviewRequirements": [
      "Human review before operational use"
    ]
  },
  "qualityGates": [
    {
      "source": {
        "id": "urn:faf:gate:scope-and-evidence",
        "version": "1.0.0"
      },
      "phase": "post-execution",
      "passCriteria": [
        "Changes remain in scope",
        "Validation results are reported"
      ],
      "failureAction": "block",
      "evaluator": {
        "kind": "evidence-set",
        "requiredEvidence": [
          "Changes remained in documentation scope",
          "Automated validation passed"
        ]
      }
    }
  ],
  "provenance": [
    {
      "target": "/authority",
      "sources": [
        {
          "id": "urn:faf:contract:agent:reference-engineer",
          "version": "1.0.0"
        },
        {
          "id": "urn:faf:contract:task:update-docs",
          "version": "1.0.0"
        }
      ]
    },
    {
      "target": "/behavior/instructions",
      "sources": [
        {
          "id": "urn:faf:domain:software-engineering",
          "version": "1.0.0"
        },
        {
          "id": "urn:faf:role:software-engineer",
          "version": "1.0.0"
        }
      ]
    },
    {
      "target": "/behavior/policyDecisions",
      "sources": [
        {
          "id": "urn:faf:policy:reference-operations",
          "version": "1.0.0"
        }
      ]
    }
  ]
}
